tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

cask_args appdir: '/Applications'

brew 'mas'
brew 'asdf'
brew 'fish'

brew 'age'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'binutils'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'diffutils'
brew 'duck'
brew 'ed'
brew 'emacs'
brew 'findutils'
brew 'fonttools'
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'gibo'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'go'
brew 'gpg'
brew 'grep'
brew 'gzip'
brew 'helix'
brew 'htop'
brew 'hurl'
brew 'imagemagick'
brew 'jless'
brew 'jq'
brew 'less'
brew 'libressl'
brew 'lua'
brew 'luajit'
brew 'make'
brew 'moreutils'
brew 'nano'
brew 'ngrep'
brew 'nmap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'perl'
brew 'pinentry-mac'
brew 'pinentry'
brew 'pstree'
brew 'pv'
brew 'python'
brew 'rename'
brew 'rsync'
brew 'rustup'
brew 'screen'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wifi-password'
brew 'xh'
brew 'xsv'
brew 'zopfli'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'arc'
cask 'arq'
cask 'calibre'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'kitty'
cask 'meetingbar'
cask 'monitorcontrol'
cask 'rectangle'
cask 'shortcat'
cask 'slack'
cask 'spotify'
cask 'sublime-merge'
cask 'sublime-tex'
cask 'the-unarchiver'
cask 'visual-studio-code-insiders'
cask 'vlc'
cask 'xquartz'

cask 'font-fantasque-sans-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-mononoki'
cask 'font-mononoki-nerd-font'
