tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"

cask_args appdir: "/Applications"

brew "mise"
brew "fish"
brew "starship"
brew "xcodes"

brew "age"
brew "autoconf"
brew "automake"
brew "atuin"
brew "bash"
brew "bat"
brew "binutils"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "diffutils"
brew "duck"
brew "ed"
brew "emacs"
brew "ffmpeg"
brew "findutils"
brew "fonttools"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpg"
brew "grep"
brew "gzip"
brew "htop"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jless"
brew "jq"
brew "just"
brew "less"
brew "libpq"
brew "libressl"
brew "lua"
brew "luajit"
brew "make"
brew "moreutils"
brew "nano"
brew "neovim"
brew "ngrep"
brew "nmap"
brew "openssl"
brew "perl"
brew "pinentry"
brew "pinentry-mac"
brew "pstree"
brew "pv"
brew "python"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "screen"
brew "shellcheck"
brew "sops"
brew "spark"
brew "sqlite"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unzip"
brew "uv"
brew "vim"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "wifi-password"
brew "xh"
brew "youtube-dl"
brew "yq"
brew "zopfli"
brew "zsh"

brew "redis"
brew "memcached"

brew "ollama"
brew "llama.cpp"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "arq"
cask "blockblock"
cask "blockblock"
cask "calibre"
cask "ghostty"
cask "google-chrome"
cask "knockknock"
cask "leader-key"
cask "mac-mouse-fix"
cask "monitorcontrol"
cask "mullvad-vpn"
cask "netiquette"
cask "orbstack"
cask "qlvideo"
cask "raycast"
cask "rectangle"
cask "shortcat"
cask "slack"
cask "sublime-text"
cask "taskexplorer"
cask "the-unarchiver"
cask "visual-studio-code@insiders"
cask "vlc"
cask "zed"

cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-bricolage-grotesque"
cask "font-cascadia-code"
cask "font-comic-mono"
cask "font-computer-modern"
cask "font-dm-mono"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inclusive-sans"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki"
cask "font-mononoki-nerd-font"
cask "font-space-grotesk"

brew "mas"
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "iA Writer", id: 775737590
mas "Marked 2", id: 890031187
mas "NextDNS", id: 1464122853
mas "Textual 7", id: 1262957439
mas "The Unarchiver", id: 425424353
