cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "arq"
cask "blockblock"
cask "calibre"
cask "ghostty"
cask "google-chrome"
cask "knockknock"
cask "leader-key"
cask "mac-mouse-fix"
cask "monitorcontrol"
cask "mullvad-vpn"
cask "netiquette"
cask "orbstack"
cask "qlvideo"
cask "raycast"
cask "rectangle"
cask "shortcat"
cask "slack"
cask "sublime-text"
cask "taskexplorer"
cask "the-unarchiver"
cask "visual-studio-code@insiders"
cask "vlc"
cask "zed"
