brew "mise"
brew "fish"
brew "starship"
brew "xcodes"

brew "age"
brew "autoconf"
brew "automake"
brew "atuin"
brew "bash"
brew "bat"
brew "binutils"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "diffutils"
brew "duck"
brew "ed"
brew "emacs"
brew "ffmpeg"
brew "findutils"
brew "fonttools"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpg"
brew "grep"
brew "gzip"
brew "htop"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jless"
brew "jq"
brew "just"
brew "less"
brew "libpq"
brew "libressl"
brew "lua"
brew "luajit"
brew "make"
brew "moreutils"
brew "nano"
brew "neovim"
brew "ngrep"
brew "nmap"
brew "openssl"
brew "perl"
brew "pinentry"
brew "pinentry-mac"
brew "pstree"
brew "pv"
brew "python"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "screen"
brew "shellcheck"
brew "sops"
brew "spark"
brew "sqlite"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unzip"
brew "uv"
brew "vim"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "wifi-password"
brew "xh"
brew "yq"
brew "zopfli"
brew "zsh"

brew "redis"
brew "memcached"

brew "ollama"
brew "llama.cpp"
